{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/c6c052b7-29a8-41d6-89f0-ed1e8ddebb53')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c6c052b7-29a8-41d6-89f0-ed1e8ddebb53')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2022-10-01-preview",
      "properties": {
        "displayName": "Password reset on high privileged user",
        "alertRuleTemplateName": "c6c052b7-29a8-41d6-89f0-ed1e8ddebb53",
        "description": "The password of a user that is member of a high privileged role was reset.\n\nMake sure that this action was intended",
        "severity": "Medium",
        "enabled": true,
        "query": "let HighPrivRoles = dynamic([\"Global Administrator\", \"Company Administrator\", \"Privileged Authentication Administrator\", \"Privileged Role Administrator\"]);\r\nAuditLogs\r\n| where OperationName == \"Reset user password\"\r\n| mv-expand TargetResources\r\n| extend TargetUsername = tostring(TargetResources.userPrincipalName)\r\n| join kind=innerunique (\r\n    IdentityInfo \r\n    | where TimeGenerated > ago(14d)\r\n    )\r\n    on $left.TargetUsername == $right.AccountUPN\r\n| mv-expand AssignedRoles\r\n| extend AssignedRoles = tostring(AssignedRoles)\r\n| where AssignedRoles in (HighPrivRoles)\r\n| summarize by TimeGenerated, TargetUsername, AssignedRoles, OperationName, AADUserId=AccountObjectId",
        "queryFrequency": "PT3H",
        "queryPeriod": "PT3H",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "tactics": [
          "PrivilegeEscalation"
        ],
        "incidentConfiguration": {
          "groupingConfiguration": {
            "matchingMethod": "AllEntities",
            "enabled": false,
            "groupByEntities": [],
            "lookbackDuration": "PT5H",
            "reopenClosedIncident": false,
            "groupByCustomDetails": [],
            "groupByAlertDetails": []
          },
          "createIncident": true
        },
        "eventGroupingSettings": {
          "aggregationKind": "AlertPerResult"
        },
        "customDetails": {
          "AssignedRole": "AssignedRoles"
        },
        "entityMappings": [
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "AadUserId",
                "columnName": "AADUserId"
              }
            ]
          },
          {
            "entityType": "Account",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "TargetUsername"
              }
            ]
          }
        ]
      }
    }
  ]
}
